tests/performance/challenges/jsonplaceholder/config/photos-load.yml
config:
  target: 'https://jsonplaceholder.typicode.com'
  phases:
    - duration: 30
      arrivalRate: 2
      arrivalCount: 10
      name: 'Warm up'
    - duration: 60
      arrivalRate: 5
      name: 'Normal load'
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        viewport:
          width: 1280
          height: 720
  plugins:
    expect: {}
  processor: '../processors/photos-processor.cjs'
scenarios:
  - name: 'GET all photos'
    engine: playwright
    flowFunction: 'getAllPhotosFlow'
    weight: 60
  - name: 'GET photos by album'
    engine: playwright
    flowFunction: 'getPhotosByAlbumFlow'
    weight: 40