tests/performance/challenges/jsonplaceholder/config/posts-load.yml
config:
  target: 'https://jsonplaceholder.typicode.com'
  phases:
    - duration: 30
      arrivalRate: 2
      arrivalCount: 10
      name: 'Warm up'
    - duration: 60
      arrivalRate: 5
      name: 'Normal load'
    - duration: 30
      arrivalRate: 10
      name: 'Spike test'
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        viewport:
          width: 1280
          height: 720
  plugins:
    expect: {}
  processor: '../processors/posts-processor.cjs'
scenarios:
  - name: 'GET all posts'
    engine: playwright
    flowFunction: 'getAllPostsFlow'
    weight: 50
  - name: 'GET specific post'
    engine: playwright
    flowFunction: 'getPostByIdFlow'
    weight: 30
  - name: 'CREATE post'
    engine: playwright
    flowFunction: 'createPostFlow'
    weight: 20