tests/performance/challenges/jsonplaceholder/config/spike-test.yml
config:
  target: 'https://jsonplaceholder.typicode.com'
  phases:
    - duration: 30
      arrivalRate: 2
      name: 'Warm up'
    - duration: 30
      arrivalRate: 5
      name: 'Normal load'
    - duration: 10
      arrivalRate: 30
      name: 'Spike'
    - duration: 30
      arrivalRate: 5
      name: 'Recovery'
    - duration: 15
      arrivalRate: 0
      name: 'Ramp down'
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        viewport:
          width: 1280
          height: 720
  plugins:
    expect: {}
  processor: '../processors/posts-processor.cjs'
scenarios:
  - name: 'GET all posts'
    engine: playwright
    flowFunction: 'getAllPostsFlow'
    weight: 50
  - name: 'GET specific post'
    engine: playwright
    flowFunction: 'getPostByIdFlow'
    weight: 50